package com.joymeng.slg.union.task;

public class UnionTaskEvent {
	/**
	 * 0.	出勤任务：联盟今日有多少玩家登陆游戏；
1.	联盟帮助：联盟成员今日给其它成员提供的总帮助次数
2.	联盟科技捐献：联盟成员今日的捐献总次数
3.	联盟礼包：联盟成员今日累计领取的联盟礼包数量；
4.	废墟通关：联盟成员今日累计通关废墟的次数；
5.	采集食品任务：联盟成员在世界地图上采集到食品的数量
6.	采集金属任务：联盟成员在世界地图上采集到金属的数量
7.	采集石油任务：联盟成员在世界地图上采集到石油的数量
8.	采集合金任务：联盟成员在世界地图上采集到合金的数量
9.	采集资源任务：联盟成员在世界地图上采集到任意资源的数量
10.	掠夺食品任务：联盟成员今日累计掠夺食品的数量；
11.	掠夺金属任务：联盟成员今日累计掠夺金属的数量；
12.	掠夺石油任务：联盟成员今日累计掠夺石油的数量；
13.	掠夺合金任务：联盟成员今日累计掠夺合金的数量；
14.	掠夺资源任务：联盟成员今日累计掠夺任意资源的数量；
15.	士兵生产：联盟成员今日累计生产士兵部队的总空间
16.	战车生产：联盟成员今日累计生产士兵部队的总空间
17.	坦克生产：联盟成员今日累计生产士兵部队的总空间
18.	战机生产：联盟成员今日累计生产士兵部队的总空间
19.	城防设施生产：联盟成员今日累计生产城防设施的总空间
20.	部队生产：联盟成员今日累计生产部队的总空间；
21.	部队消灭：联盟成员今日累计击杀所有部队的总空间
22.	部队治疗：联盟成员今日累计医疗部队的总空间
23.	部队维修：联盟成员今日累计维修部队的总空间
24.	叛军击杀：联盟成员今日累计击杀某个等级以上或全部叛军的总数量
25.	多人限时：联盟成员以多人组队的方式进行的限时型任务

	 */
	public static final short TASK_ATTENDANCE = 0;//出勤任务
	public static final short HELP_TASK = 1;//联盟帮助

}
